results/fail.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: slo-test-fail.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m01.0s/2m0s

running (0m02.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m02.0s/2m0s

running (0m03.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m03.0s/2m0s

running (0m04.0s), 20/20 VUs, 58 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m04.0s/2m0s

running (0m05.0s), 20/20 VUs, 62 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m05.0s/2m0s

running (0m06.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m06.0s/2m0s

running (0m07.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m07.0s/2m0s

running (0m08.0s), 20/20 VUs, 116 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m08.0s/2m0s

running (0m09.0s), 20/20 VUs, 124 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m09.0s/2m0s

running (0m10.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m10.0s/2m0s

running (0m11.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m11.0s/2m0s

running (0m12.0s), 20/20 VUs, 178 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m12.0s/2m0s

running (0m13.0s), 20/20 VUs, 188 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m13.0s/2m0s

running (0m14.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m14.0s/2m0s

running (0m15.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m15.0s/2m0s

running (0m16.0s), 20/20 VUs, 238 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m16.0s/2m0s

running (0m17.0s), 20/20 VUs, 252 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m17.0s/2m0s

running (0m18.0s), 20/20 VUs, 263 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m18.0s/2m0s

running (0m19.0s), 20/20 VUs, 281 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m19.0s/2m0s

running (0m20.0s), 20/20 VUs, 299 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m20.0s/2m0s

running (0m21.0s), 20/20 VUs, 312 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m21.0s/2m0s

running (0m22.0s), 20/20 VUs, 323 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m22.0s/2m0s

running (0m23.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m23.0s/2m0s

running (0m24.0s), 20/20 VUs, 359 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m24.0s/2m0s

running (0m25.0s), 20/20 VUs, 374 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  0m25.0s/2m0s

running (0m26.0s), 20/20 VUs, 384 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m26.0s/2m0s

running (0m27.0s), 20/20 VUs, 401 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m27.0s/2m0s

running (0m28.0s), 20/20 VUs, 420 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  0m28.0s/2m0s

running (0m29.0s), 20/20 VUs, 438 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  0m29.0s/2m0s

running (0m30.0s), 20/20 VUs, 444 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m30.0s/2m0s

running (0m31.0s), 20/20 VUs, 462 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  0m31.0s/2m0s

running (0m32.0s), 20/20 VUs, 480 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m32.0s/2m0s

running (0m33.0s), 20/20 VUs, 497 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m33.0s/2m0s

running (0m34.0s), 20/20 VUs, 509 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  0m34.0s/2m0s

running (0m34.9s), 20/20 VUs, 522 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  0m34.9s/2m0s

running (0m35.0s), 20/20 VUs, 523 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  0m35.0s/2m0s

running (0m35.0s), 20/20 VUs, 524 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  0m35.0s/2m0s

running (0m35.1s), 20/20 VUs, 524 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  0m35.1s/2m0s

running (0m35.3s), 20/20 VUs, 528 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  0m35.3s/2m0s

running (0m35.4s), 20/20 VUs, 531 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m35.4s/2m0s

running (0m35.5s), 20/20 VUs, 534 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m35.5s/2m0s

running (0m35.6s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m35.6s/2m0s

running (0m35.7s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m35.7s/2m0s

running (0m35.8s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m35.8s/2m0s

running (0m35.9s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m35.9s/2m0s

running (0m35.9s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m35.9s/2m0s

running (0m36.0s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m36.0s/2m0s

running (0m37.0s), 20/20 VUs, 560 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  0m37.0s/2m0s

running (0m38.0s), 20/20 VUs, 572 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m38.0s/2m0s

running (0m39.0s), 20/20 VUs, 584 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m39.0s/2m0s

running (0m40.0s), 20/20 VUs, 600 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m40.0s/2m0s

running (0m41.0s), 20/20 VUs, 620 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  0m41.0s/2m0s

running (0m42.0s), 20/20 VUs, 634 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  0m42.0s/2m0s

running (0m43.0s), 20/20 VUs, 646 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  0m43.0s/2m0s

running (0m44.0s), 20/20 VUs, 662 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m44.0s/2m0s

running (0m45.0s), 20/20 VUs, 680 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m45.0s/2m0s

running (0m46.0s), 20/20 VUs, 694 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  0m46.0s/2m0s

running (0m47.0s), 20/20 VUs, 710 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  0m47.0s/2m0s

running (0m48.0s), 20/20 VUs, 724 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m48.0s/2m0s

running (0m49.0s), 20/20 VUs, 740 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  0m49.0s/2m0s

running (0m50.0s), 20/20 VUs, 757 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m50.0s/2m0s

running (0m51.0s), 20/20 VUs, 771 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m51.0s/2m0s

running (0m52.0s), 20/20 VUs, 786 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  0m52.0s/2m0s

running (0m53.0s), 20/20 VUs, 801 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  0m53.0s/2m0s

running (0m54.0s), 20/20 VUs, 819 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  0m54.0s/2m0s

running (0m55.0s), 20/20 VUs, 833 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  0m55.0s/2m0s

running (0m56.0s), 20/20 VUs, 847 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m56.0s/2m0s

running (0m57.0s), 20/20 VUs, 861 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m57.0s/2m0s

running (0m58.0s), 20/20 VUs, 879 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m58.0s/2m0s

running (0m59.0s), 20/20 VUs, 894 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  0m59.0s/2m0s

running (1m00.0s), 20/20 VUs, 911 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  1m00.0s/2m0s

running (1m01.0s), 20/20 VUs, 924 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  1m01.0s/2m0s

running (1m02.0s), 20/20 VUs, 941 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  1m02.0s/2m0s

running (1m03.0s), 20/20 VUs, 957 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  1m03.0s/2m0s

running (1m04.0s), 20/20 VUs, 972 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  1m04.0s/2m0s

running (1m05.0s), 20/20 VUs, 987 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  1m05.0s/2m0s

running (1m06.0s), 20/20 VUs, 1001 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  1m06.0s/2m0s

running (1m07.0s), 20/20 VUs, 1017 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  1m07.0s/2m0s

running (1m08.0s), 20/20 VUs, 1034 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  1m08.0s/2m0s

running (1m09.0s), 20/20 VUs, 1050 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  1m09.0s/2m0s

running (1m10.0s), 20/20 VUs, 1062 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  1m10.0s/2m0s

running (1m11.0s), 20/20 VUs, 1080 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  1m11.0s/2m0s

running (1m12.0s), 20/20 VUs, 1096 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  1m12.0s/2m0s

running (1m13.0s), 20/20 VUs, 1110 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  1m13.0s/2m0s

running (1m14.0s), 20/20 VUs, 1125 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  1m14.0s/2m0s

running (1m15.0s), 20/20 VUs, 1141 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  1m15.0s/2m0s

running (1m16.0s), 20/20 VUs, 1157 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  1m16.0s/2m0s

running (1m17.0s), 20/20 VUs, 1173 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  1m17.0s/2m0s

running (1m18.0s), 20/20 VUs, 1185 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  1m18.0s/2m0s

running (1m19.0s), 20/20 VUs, 1202 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  1m19.0s/2m0s

running (1m20.0s), 20/20 VUs, 1221 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  1m20.0s/2m0s

running (1m21.0s), 20/20 VUs, 1234 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  1m21.0s/2m0s

running (1m22.0s), 20/20 VUs, 1246 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  1m22.0s/2m0s

running (1m23.0s), 20/20 VUs, 1263 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  1m23.0s/2m0s

running (1m24.0s), 20/20 VUs, 1280 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  1m24.0s/2m0s

running (1m25.0s), 20/20 VUs, 1297 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  1m25.0s/2m0s

running (1m26.0s), 20/20 VUs, 1310 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  1m26.0s/2m0s

running (1m27.0s), 20/20 VUs, 1323 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  1m27.0s/2m0s

running (1m28.0s), 20/20 VUs, 1341 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  1m28.0s/2m0s

running (1m29.0s), 20/20 VUs, 1359 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  1m29.0s/2m0s

running (1m30.0s), 20/20 VUs, 1372 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  1m30.0s/2m0s

running (1m31.0s), 20/20 VUs, 1385 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  1m31.0s/2m0s

running (1m32.0s), 20/20 VUs, 1402 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  1m32.0s/2m0s

running (1m33.0s), 20/20 VUs, 1420 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  1m33.0s/2m0s

running (1m34.0s), 20/20 VUs, 1436 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  1m34.0s/2m0s

running (1m35.0s), 20/20 VUs, 1447 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  1m35.0s/2m0s

running (1m36.0s), 20/20 VUs, 1462 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  1m36.0s/2m0s

running (1m37.0s), 20/20 VUs, 1481 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  1m37.0s/2m0s

running (1m38.0s), 20/20 VUs, 1499 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  1m38.0s/2m0s

running (1m39.0s), 20/20 VUs, 1513 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  1m39.0s/2m0s

running (1m40.0s), 20/20 VUs, 1523 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  1m40.0s/2m0s

running (1m41.0s), 20/20 VUs, 1542 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  1m41.0s/2m0s

running (1m42.0s), 20/20 VUs, 1559 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  1m42.0s/2m0s

running (1m43.0s), 20/20 VUs, 1574 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  1m43.0s/2m0s

running (1m44.0s), 20/20 VUs, 1585 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  1m44.0s/2m0s

running (1m45.0s), 20/20 VUs, 1603 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  1m45.0s/2m0s

running (1m46.0s), 20/20 VUs, 1621 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  1m46.0s/2m0s

running (1m47.0s), 20/20 VUs, 1636 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  1m47.0s/2m0s

running (1m48.0s), 20/20 VUs, 1648 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  1m48.0s/2m0s

running (1m49.0s), 20/20 VUs, 1665 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  1m49.0s/2m0s

running (1m50.0s), 20/20 VUs, 1682 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  1m50.0s/2m0s

running (1m51.0s), 20/20 VUs, 1699 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  1m51.0s/2m0s

running (1m52.0s), 20/20 VUs, 1711 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  1m52.0s/2m0s

running (1m53.0s), 20/20 VUs, 1726 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  1m53.0s/2m0s

running (1m54.0s), 20/20 VUs, 1742 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  1m54.0s/2m0s

running (1m55.0s), 20/20 VUs, 1760 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  1m55.0s/2m0s

running (1m56.0s), 20/20 VUs, 1772 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  1m56.0s/2m0s

running (1m57.0s), 20/20 VUs, 1787 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  1m57.0s/2m0s

running (1m58.0s), 20/20 VUs, 1804 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  1m58.0s/2m0s

running (1m59.0s), 20/20 VUs, 1821 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  1m59.0s/2m0s

running (2m00.0s), 20/20 VUs, 1835 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  2m00.0s/2m0s

running (2m01.0s), 08/20 VUs, 1847 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  2m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.90' rate=98.52%

    http_req_duration{name:cart}
    ✓ 'p(95)<200' p(95)=688.65µs

    http_req_duration{name:report}
    ✗ 'p(95)<100' p(95)=388.12ms

    http_req_failed{name:pay}
    ✓ 'rate<0.08' rate=4.42%


  █ TOTAL RESULTS 

    checks_total.......: 5565   45.850022/s
    checks_succeeded...: 98.52% 5483 out of 5565
    checks_failed......: 1.47%  82 out of 5565

    ✓ cart 200
    ✓ report 200
    ✗ pay 200
      ↳  95% — ✓ 1773 / ✗ 82

    HTTP
    http_req_duration..............: avg=100.09ms min=155.59µs med=490.67µs max=399.99ms p(90)=338.21ms p(95)=365.94ms
      { expected_response:true }...: avg=101.58ms min=155.59µs med=495.69µs max=399.99ms p(90)=339.26ms p(95)=366.4ms 
      { name:cart }................: avg=627.29µs min=183.55µs med=480.6µs  max=19.4ms   p(90)=617.68µs p(95)=688.65µs
      { name:report }..............: avg=299.32ms min=200.02ms med=300.16ms max=399.99ms p(90)=376.89ms p(95)=388.12ms
    http_req_failed................: 1.47%  82 out of 5565
      { name:pay }.................: 4.42%  82 out of 1855
    http_reqs......................: 5565   45.850022/s

    EXECUTION
    iteration_duration.............: avg=1.3s     min=1.2s     med=1.3s     max=1.4s     p(90)=1.37s    p(95)=1.38s   
    iterations.....................: 1855   15.283341/s
    vus............................: 8      min=8          max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 1.4 MB 12 kB/s
    data_sent......................: 495 kB 4.1 kB/s



running (2m01.4s), 00/20 VUs, 1855 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s
time="2026-09-22T10:17:52+08:00" level=error msg="thresholds on metrics 'http_req_duration{name:report}' have been crossed"